package cn

/**
  中文
*/

var Lang = map[string]interface{}{
	// 内置模块
	"-1000": "这是中文包",
	"-1001": "请求头中auth格式有误",
	"-1002": "解析token出错，请重新请求",
	"-1003": "登录超时,请重新登录...",
	"-1004": "没有权限操作...",
	// 全部查询出错返回统一数据
	"-1101": "查询有误，请重新尝试",
	"-1102": "操作有误，请重新尝试",
	"-1103": "新增失败，请重新尝试",

	// 登陆模块
	"-10001": "用户账号或密码出错",
	"-10002": "验证码不正确，请重新输入。",
	"-10003": "登陆失败，生成token错误",
	"-10004": "账号格式输入错误！",
	"-10005": "密码格式输入错误！",
	"-10006": "验证码必填（4位）！",

	// 上传图片
	"-11000": "上传图片失败！请检查日志",
	// 刪除
	"-12000": "主鍵id缺失",
}
